Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum
Detailed error code for sharing operation

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.NO_ERROR
No error, operation completed successfully

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.DISK_FULL
Operation failed because of disk full error

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.FILE_BUSY
Operation failed because a file is busy
dotSharingOperation_t.aErrorDetail should contain the file path

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.FILE_PATH_TOO_LONG
Operation failed because a file path is too long
dotSharingOperation_t.aErrorDetail should contain the file path

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.FILE_COPY_ERROR
Operation failed because file copy failed
dotSharingOperation_t.aErrorDetail should contain the file path

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.FOLDER_CREATION_ERROR
Operation failed because folder creation failed
dotSharingOperation_t.aErrorDetail should contain the folder path

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.DATABASE_ERROR
Database integrity error detected during operation

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.UNKNOWN_ERROR
Operation failed, no specific error information available

Tekla.Structures.ModelInternal.Operation.DotSharingErrorCodeEnum.UNPERMITTED_WRITE_OUT_CHANGES
Unpermitted write out changes